<?php
// 6. В городе N проезд в трамвае осуществляется по бумажным отрывным билетам.
// Каждую неделю трамвайное депо заказывает в местной типографии рулон билетов
//  с номерами от 000001 до 999999.
// «Счастливым» считается билетик у которого сумма первых трёх цифр номера равна
// сумме последних трёх цифр, как, например, в билетах с номерами 003102 или 567576.
//  Трамвайное депо решило подарить сувенир обладателю каждого счастливого билета и
//  теперь раздумывает, как много сувениров потребуется.
//  Подсчитайте сколько счастливых билетов в одном рулоне (информацию на экран).

//Не придумала, как решить вопрос
?>
